export const skillName: Record<string, string[]> =
{
    '나이트로드' : ['스프레드스로우', '쿼드러플', '마크', '스로우 블래스팅', '비전서', '풍마수리검'],
    '나이트워커' : ['쿼터플스로우', '쉐도우스피어', '래피드스로우', '쉐도우배트', '팔랑크스', '쉐도우바이트'],
    '다크나이트' : ['궁그닐디센트', '다크스피어', '피어스사이클론', '비홀더임팩트', '다크니스오라', '비홀더쇼크'],
    '데몬슬레이어' : ['슬래시', '데몬임팩트', '오르트로스', '데몬베인', '요르문간드', '메타모포시스'],
    '듀얼블레이드' : ['팬텀블로우', '블레이드스톰', '블토', '카르마퓨리', '아수라', '헌티드엣지'],
    '라라' : ['흡수', '정기 뿌리기', '분출', '해강산', '큰기지개', '굽이굽이'],
    '루미너스' : ['앱솔루트킬', '빛과어둠세례', '리소네이터', '리버레이션', '아포칼립스', '진리의문'],
    '메르세데스' : ['이르칼라', '래쓰오브엔릴', '이슈타르의링', '듀얼샷', '로얄나이츠', '유니콘'],
    '메카닉' : ['호밍미사일', '마이크로미사일', '메카캐리어', '매시브파이어', '전탄발사', '멀티플옵션'],
    '미하일' : ['소울 어썰트', '소울 라이트', '로얄 가드', '팔랑크스', '클라우솔라스', '샤이닝크로스'],
    '바이퍼' : ['피스트', '서펜트스크류', '하울링피스트', '퓨리어스차지', '서펜트어썰트', '라이트닝폼'],
    '배틀메이지' : ['다크라이트닝', '유니온 오라', '블랙매직알터', '어비셜라이트닝', '데스', '그림리퍼'],
    '보우마스터' : ['폭풍의 시', '잔영의 시', '퀴버풀버스트', '플래시미라주', '애로우 레인', '퀴버 카트리지'],
    '블래스터' : ['더블팡', '매그넘펀치', '벙커 버스터', '리볼빙 캐논', '릴리즈파일벙커', '버닝브레이커'],
    '비숍' : ['엔젤레이', '퍼니시먼트', '트라이엄프페더', '피스메이커', '엔젤오브리브라', '파운틴'],
    '섀도어' : ['암살', '메소익스플로젼', '소닉블로우', '절개', '멸귀참영진', '다크플레어'],
    '소울마스터' : ['스틱스', '댄스오브문', '셀레스티얼', '플레어슬래시', '팔랑크스', '소울이클립스'],
    '스트라이커' : ['섬멸', '벽력', '교아탄', '창뇌연격', '뇌신창격', '팔랑크스'],
    '신궁' : ['스나이핑', '스플릿애로우', '리피팅', '트루 스나이핑', '가이디드애로우', '차지드애로우'],
    '아델' : ['오더', '디바이드', '인피니티', '블로섬', '크리에이션', '테리토리'],
    '아란' : ['비욘더', '펜릴 크래시', '헌터즈타겟팅', '템페스트', '파이널블로우', '파이널 어택'],
    '아크' : ['다가오는죽음', '악몽/흉몽', '근원의 기억', '굶주리는짐승', '플레임차지', '끝없는고통'],
    '아크메이지(불,독)' : ['플레임 스윕', '미스트이럽션', '도트퍼니셔', '이그나이트', '포이즌리젼', '플레임헤이즈'],
    '아크메이지(썬,콜)' : ['체인라이트닝', '썬더브레이크', '썬더스피어', '라이트닝스피어', '주피터썬더', '포로즌오브'],
    '에반' : ['서클오브마나', '조디악레이', '서클오브어스', '스파이럴', '임페리얼', '드래곤브레스'],
    '엔젤릭버스터' : ['트리니티', '소울시커', '스포트라이트', '패밀리어', '트리니티퓨전', '슈퍼노바'],
    '와일드헌터' : ['어나더바이트', '와일드발칸', '램피지애즈원', '소닉붐', 'Type X', '클로우 컷'],
    '윈드브레이커' : ['트라이플링윔', '하울링게일', '천공의노래', '볼텍스스피어', '스톰 브링어', '아이들윔'],
    '은월' : ['귀참', '소혼 장막', '진귀참', '귀문진', '불여우령', '파쇄연권'],
    '일리움' : ['자벨린', '이그니션', '데우스', '디스트럭션', '크리스탈게이트', '그람홀더'],
    '제로' : ['롤링 어썰터', '피어스쓰러스트', '롤링커브', '스핀커터', '조인트어택', '에고웨폰'],
    '카데나' : ['니들배트', '메일스트롬', 'A.D 오드넌스', '웨폰버라이어티', '프로페셔널', '체인아츠:퓨리'],
    '카이저' : ['기가 슬래셔', '드라코 슬래셔', '드래곤블레이즈', '윌오소-스트', '가디언오브노바', '윙비트'],
    '카인' : ['데스 블레싱', '드래곤팡', '애거니', '드래곤버스트', '페이탈블리츠', '타나토스'],
    '캐논슈터' : ['캐논 버스터', '기간틱 캐논볼', 'ICBM', '몽키에스코트', '서포트 몽키', '풀메이커'],
    '캡틴' : ['헤드샷', '캡틴디그니티', '배틀쉽봄버', '래피드파이어', '어셈블크루', '데스트리거'],
    '키네시스' : ['메테리얼', '토네이도', 'BPM', '무빙 매터', '그라비티', '트레인'],
    '팔라딘' : ['블래스트', '그랜드크로스', '블래스드해머', '디바인저지먼트', '마이티묠니르', '생츄어리'],
    '패스파인더' : ['카디널블래스트', '카디널디스차지', '트리플임팩트', '레이븐템페스트', '레조넌스', '얼티밋블래스트'],
    '팬텀' : ['느와르카르트', '블랙잭', '조커', '얼티밋드라이브', '템페스트', '마크오브팬텀'],
    '플레임위자드' : ['오비탈플레임', '플레임서클', '블레이징오비탈', '샐리맨더', '익스팅션', '팔랑크스'],
    '호영' : ['분신난무', '토파류', '흡성와류', '귀화부', '괴력난신', '천지인 환영'],
    '히어로' : ['레이징블로우', '소오버', '인스팅트', '파이널어택', '소드일루젼', '발할라'],
}



//효율, 최대렙

export const NightLord: Record<string, number[]> =
{
    '스프레드스로우' : [0.2704, 30],
    '쿼드러플' : [0.2765, 60],
    '마크' : [0.1291, 60],
    '스로우 블래스팅' : [0.1771, 30],
    '비전서' : [0.0585, 30],
    '풍마수리검' : [0.0508, 30],
}


export const NightWalker: Record<string, number[]> =
{
    '쿼터플스로우' : [0.4909, 60],
    '쉐도우스피어' : [0.2116, 30],
    '래피드스로우' : [0.1423, 30],
    '쉐도우배트' : [0.0665, 60],
    '팔랑크스' : [0.0561, 30],
    '쉐도우바이트' : [0.021, 30],
}


export const DarkKnight: Record<string, number[]> =
{
    '궁그닐디센트' : [0.3185, 60],
    '다크스피어' : [0.2179, 30],
    '피어스사이클론' : [0.1358, 30],
    '비홀더임팩트' : [0.1227, 30],
    '다크니스오라' : [0.0651, 30],
    '비홀더쇼크' : [0.0794, 60],
}


export const DemonSlayer: Record<string, number[]> =
{
    '슬래시' : [0.5088, 60],
    '데몬임팩트' : [0.1118, 60],
    '오르트로스' : [0.0854, 30],
    '데몬베인' : [0.0794, 30],
    '요르문간드' : [0.0729, 30],
    '메타모포시스' : [0.0385, 60],
}


export const DualBlader: Record<string, number[]> =
{
    '팬텀블로우' : [0.248, 60],
    '블레이드스톰' : [0.2184, 30],
    '블토' : [0.1868, 30],
    '카르마퓨리' : [0.1448, 30],
    '아수라' : [0.1148, 60],
    '헌티드엣지' : [0.0537, 30],
}


export const Lara: Record<string, number[]> =
{
    '흡수' : [0.1631, 60],
    '정기 뿌리기' : [0.138, 60],
    '분출' : [0.2313, 60],
    '해강산' : [0.11, 30],
    '큰기지개' : [0.0885, 30],
    '굽이굽이' : [0.0817, 30],
}


export const Luminous: Record<string, number[]> =
{
    '앱솔루트킬' : [0.4084, 60],
    '빛과어둠세례' : [0.234, 30],
    '리소네이터' : [0.1304, 30],
    '리버레이션' : [0.0954, 30],
    '아포칼립스' : [0.0544, 60],
    '진리의문' : [0.0497, 30],
}


export const Mercedes: Record<string, number[]> =
{
    '이르칼라' : [0.224, 30],
    '래쓰오브엔릴' : [0.1243, 60],
    '이슈타르의링' : [0.1138, 60],
    '듀얼샷' : [0.1705, 60],
    '로얄나이츠' : [0.0752, 30],
    '유니콘' : [0.0681, 60],
}


export const Mechanic: Record<string, number[]> =
{
    '호밍미사일' : [0.2395, 60],
    '마이크로미사일' : [0.1663, 30],
    '메카캐리어' : [0.1274, 30],
    '매시브파이어' : [0.1272, 60],
    '전탄발사' : [0.0832, 30],
    '멀티플옵션' : [0.072, 30],
}


export const Mikhail: Record<string, number[]> =
{
    '소울 어썰트' : [0.2583, 60],
    '소울 라이트' : [0.2547, 30],
    '로얄 가드' : [0.1077, 60],
    '팔랑크스' : [0.0922, 30],
    '클라우솔라스' : [0.0685, 30],
    '샤이닝크로스' : [0.0509, 60],
}


export const Viper: Record<string, number[]> =
{
    '피스트' : [0.3309, 60],
    '서펜트스크류' : [0.2604, 30],
    '하울링피스트' : [0.1448, 30],
    '퓨리어스차지' : [0.0596, 30],
    '서펜트어썰트' : [0.1107, 60],
    '라이트닝폼' : [0.0434, 30],
}


export const BattleMage: Record<string, number[]> =
{
    '다크라이트닝' : [0.27, 60],
    '유니온 오라' : [0.1457, 30],
    '블랙매직알터' : [0.1337, 30],
    '어비셜라이트닝' : [0.1068, 30],
    '데스' : [0.0922, 60],
    '그림리퍼' : [0.0796, 30],
}


export const Bowmaster: Record<string, number[]> =
{
    '폭풍의 시' : [0.2365, 60],
    '잔영의 시' : [0.1702, 30],
    '퀴버풀버스트' : [0.1201, 30],
    '플래시미라주' : [0.1353, 60],
    '애로우 레인' : [0.0965, 30],
    '퀴버 카트리지' : [0.0813, 60],
}


export const Blaster: Record<string, number[]> =
{
    '더블팡' : [0.1485, 60],
    '매그넘펀치' : [0.1326, 60],
    '벙커 버스터' : [0.1201, 30],
    '리볼빙 캐논' : [0.0979, 60],
    '릴리즈파일벙커' : [0.0962, 60],
    '버닝브레이커' : [0.0953, 30],
}


export const Bishop: Record<string, number[]> =
{
    '엔젤레이' : [0.3995, 60],
    '퍼니시먼트' : [0.211, 30],
    '트라이엄프페더' : [0.1549, 60],
    '피스메이커' : [0.0902, 30],
    '엔젤오브리브라' : [0.0513, 30],
    '파운틴' : [0.0534, 60],
}


export const Shadower: Record<string, number[]> =
{
    '암살' : [0.497, 60],
    '메소익스플로젼' : [0.1543, 60],
    '소닉블로우' : [0.134, 30],
    '절개' : [0.0903, 30],
    '멸귀참영진' : [0.0794, 30],
    '다크플레어' : [0.0234, 90],
}


export const SoulMaster: Record<string, number[]> =
{
    '스틱스' : [0.3255, 60],
    '댄스오브문' : [0.27419, 60],
    '셀레스티얼' : [0.13255, 30],
    '플레어슬래시' : [0.0794, 30],
    '팔랑크스' : [0.049, 30],
    '소울이클립스' : [0.0715, 30],
}


export const Striker: Record<string, number[]> =
{
    '섬멸' : [0.3494, 60],
    '벽력' : [0.2497, 60],
    '교아탄' : [0.0994, 30],
    '창뇌연격' : [0.0917, 30],
    '뇌신창격' : [0.0857, 30],
    '팔랑크스' : [0.0571, 30],
}


export const Marksman: Record<string, number[]> =
{
    '스나이핑' : [0.4729, 60],
    '스플릿애로우' : [0.2578, 30],
    '리피팅' : [0.0895, 30],
    '트루 스나이핑' : [0.0507, 30],
    '가이디드애로우' : [0.0396, 30],
    '차지드애로우' : [0.0393, 30],
}


export const Adele: Record<string, number[]> =
{
    '오더' : [0.2023, 60],
    '디바이드' : [0.153, 60],
    '인피니티' : [0.1295, 30],
    '블로섬' : [0.0986, 60],
    '크리에이션' : [0.1436, 60],
    '테리토리' : [0.0892, 60],
}


export const Aran: Record<string, number[]> =
{
    '비욘더' : [0.3045, 60],
    '펜릴 크래시' : [0.2159, 30],
    '헌터즈타겟팅' : [0.1349, 60],
    '템페스트' : [0.0904, 30],
    '파이널블로우' : [0.0868, 60],
    '파이널 어택' : [0.0737, 60],
}


export const Ark: Record<string, number[]> =
{
    '다가오는죽음' : [0.3367, 60],
    '악몽/흉몽' : [0.0881, 60],
    '근원의 기억' : [0.0834, 30],
    '굶주리는짐승' : [0.0663, 30],
    '플레임차지' : [0.1176, 60],
    '끝없는고통' : [0.0318, 30],
}


export const ArchMageFP: Record<string, number[]> =
{
    '플레임 스윕' : [0.1488, 60],
    '미스트이럽션' : [0.1451, 60],
    '도트퍼니셔' : [0.1355, 30],
    '이그나이트' : [0.12, 120],
    '포이즌리젼' : [0.1091, 90],
    '플레임헤이즈' : [0.0731, 60],
}


export const ArchMageTC: Record<string, number[]> =
{
    '체인라이트닝' : [0.2908, 60],
    '썬더브레이크' : [0.1365, 30],
    '썬더스피어' : [0.1249, 90],
    '라이트닝스피어' : [0.0948, 60],
    '주피터썬더' : [0.0899, 30],
    '포로즌오브' : [0.0779, 60],
}


export const Evan: Record<string, number[]> =
{
    '서클오브마나' : [0.2708, 60],
    '조디악레이' : [0.1463, 30],
    '서클오브어스' : [0.139, 60],
    '스파이럴' : [0.1051, 30],
    '임페리얼' : [0.0838, 30],
    '드래곤브레스' : [0.0811, 60],
}


export const AngelicBuster: Record<string, number[]> =
{
    '트리니티' : [0.4349, 60],
    '소울시커' : [0.2692, 60],
    '스포트라이트' : [0.0987, 30],
    '패밀리어' : [0.0645, 30],
    '트리니티퓨전' : [0.0603, 30],
    '슈퍼노바' : [0.0315, 60],
}


export const WildHunter: Record<string, number[]> =
{
    '어나더바이트' : [0.1831, 60],
    '와일드발칸' : [0.1245, 60],
    '램피지애즈원' : [0.1021, 60],
    '소닉붐' : [0.1161, 60],
    'Type X' : [0.0842, 30],
    '클로우 컷' : [0.0653, 60],
}


export const WindBreaker: Record<string, number[]> =
{
    '트라이플링윔' : [0.2446, 60],
    '하울링게일' : [0.177, 30],
    '천공의노래' : [0.1385, 60],
    '볼텍스스피어' : [0.1163, 30],
    '스톰 브링어' : [0.0952, 60],
    '아이들윔' : [0.0733, 30],
}


export const Eunwol: Record<string, number[]> =
{
    '귀참' : [0.3005, 60],
    '소혼 장막' : [0.2367, 60],
    '진귀참' : [0.1283, 30],
    '귀문진' : [0.1045, 30],
    '불여우령' : [0.1032, 60],
    '파쇄연권' : [0.0708, 30],
}


export const Illium: Record<string, number[]> =
{
    '자벨린' : [0.5103, 60],
    '이그니션' : [0.0907, 30],
    '데우스' : [0.0815, 60],
    '디스트럭션' : [0.0743, 60],
    '크리스탈게이트' : [0.0598, 30],
    '그람홀더' : [0.0545, 30],
}


export const Zero: Record<string, number[]> =
{
    '롤링 어썰터' : [0.1167, 60],
    '피어스쓰러스트' : [0.1015, 60],
    '롤링커브' : [0.1034, 60],
    '스핀커터' : [0.1166, 60],
    '조인트어택' : [0.0725, 30],
    '에고웨폰' : [0.0695, 30],
}


export const Cadena: Record<string, number[]> =
{
    '니들배트' : [0.1506, 60],
    '메일스트롬' : [0.1208, 30],
    'A.D 오드넌스' : [0.118, 30],
    '웨폰버라이어티' : [0.1737, 60],
    '프로페셔널' : [0.0874, 60],
    '체인아츠:퓨리' : [0.0588, 30],
}


export const Kaiser: Record<string, number[]> =
{
    '기가 슬래셔' : [0.271, 60],
    '드라코 슬래셔' : [0.255, 30],
    '드래곤블레이즈' : [0.1274, 30],
    '윌오소-스트' : [0.0843, 30],
    '가디언오브노바' : [0.0831, 30],
    '윙비트' : [0.0692, 90],
}


export const Kain: Record<string, number[]> =
{
    '데스 블레싱' : [0.1678, 60],
    '드래곤팡' : [0.1555, 60],
    '애거니' : [0.0795, 30],
    '드래곤버스트' : [0.0638, 30],
    '페이탈블리츠' : [0.0539, 30],
    '타나토스' : [0.05, 30],
}


export const CannonMaster: Record<string, number[]> =
{
    '캐논 버스터' : [0.3926, 60],
    '기간틱 캐논볼' : [0.2292, 30],
    'ICBM' : [0.0877, 30],
    '몽키에스코트' : [0.0806, 30],
    '서포트 몽키' : [0.064, 60],
    '풀메이커' : [0.0566, 30],
}


export const Captain: Record<string, number[]> =
{
    '헤드샷' : [0.2246, 60],
    '캡틴디그니티' : [0.1365, 60],
    '배틀쉽봄버' : [0.1293, 60],
    '래피드파이어' : [0.1285, 60],
    '어셈블크루' : [0.0926, 60],
    '데스트리거' : [0.0913, 30],
}


export const Kinesis: Record<string, number[]> =
{
    '메테리얼' : [0.2115, 60],
    '토네이도' : [0.1727, 30],
    'BPM' : [0.141, 60],
    '무빙 매터' : [0.1339, 30],
    '그라비티' : [0.1068, 30],
    '트레인' : [0.0993, 60],
}


export const Palladin: Record<string, number[]> =
{
    '블래스트' : [0.3501, 60],
    '그랜드크로스' : [0.2049, 30],
    '블래스드해머' : [0.1565, 30],
    '디바인저지먼트' : [0.0992, 60],
    '마이티묠니르' : [0.0777, 30],
    '생츄어리' : [0.0478, 60],
}


export const PathFinder: Record<string, number[]> =
{
    '카디널블래스트' : [0.2375, 60],
    '카디널디스차지' : [0.237, 60],
    '트리플임팩트' : [0.1297, 60],
    '레이븐템페스트' : [0.1106, 30],
    '레조넌스' : [0.1047, 60],
    '얼티밋블래스트' : [0.0491, 30],
}


export const Phantom: Record<string, number[]> =
{
    '느와르카르트' : [0.2582, 60],
    '블랙잭' : [0.1639, 30],
    '조커' : [0.1597, 30],
    '얼티밋드라이브' : [0.1074, 60],
    '템페스트' : [0.1, 60],
    '마크오브팬텀' : [0.0925, 30],
}


export const FlameWizard: Record<string, number[]> =
{
    '오비탈플레임' : [0.2739, 60],
    '플레임서클' : [0.247, 30],
    '블레이징오비탈' : [0.1293, 30],
    '샐리맨더' : [0.0971, 30],
    '익스팅션' : [0.0868, 60],
    '팔랑크스' : [0.0664, 30],
}


export const Hoyeong: Record<string, number[]> =
{
    '분신난무' : [0.1937, 30],
    '토파류' : [0.2048, 60],
    '흡성와류' : [0.0926, 60],
    '귀화부' : [0.0736, 60],
    '괴력난신' : [0.0705, 30],
    '천지인 환영' : [0.0658, 30],
}


export const Hero: Record<string, number[]> =
{
    '레이징블로우' : [0.314, 60],
    '소오버' : [0.1565, 30],
    '인스팅트' : [0.1387, 30],
    '파이널어택' : [0.1154, 30],
    '소드일루젼' : [0.0622, 30],
    '발할라' : [0.0423, 30],
}

export const Xenon: Record<string, number[]> =
{
    '퍼지롭' : [0.3325, 60],
    '메가 스매셔' : [0.1902, 30],
    '홀로그램:융합' : [0.1715, 30],
    '포톤레이' : [0.1091, 30],
    '레지스탕스' : [0.0583, 30],
    '오버로드모드' : [0.0365, 30],
}

export const DemonAvenger: Record<string, number[]> =
{
    '익시드:엑스큐션' : [0.3117, 60],
    '데몬 프렌지' : [0.249, 30],
    '실드체이싱' : [0.2198, 60],
    '디멘션 소드' : [0.0537, 30],
    '블러드피스트' : [0.0524, 30],
    '인핸스드익시드' : [0.0294, 60],
}
